## Pandas

In [2]:
import pandas as pd

In [3]:
print(pd.__version__)

1.5.3

In [4]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])

In [5]:
type(data)

pandas.core.series.Series

In [6]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [7]:
type(data.values)

numpy.ndarray

In [8]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
type(data.index)

pandas.core.indexes.base.Index

In [10]:
data['a']

0.25

In [11]:
data['a' : 'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [12]:
grades_dict = {'A':4, 'A-':3.5, 'B':3, 'B-':2.5, 'B':2}
grades = pd.Series(grades_dict)
grades

A     4.0
A-    3.5
B     2.0
B-    2.5
dtype: float64

In [13]:
marks_dict = {'A':85, 'A-':80, 'B':75, 'B-':70, 'B':65}
marks = pd.Series(marks_dict)
marks

A     85
A-    80
B     65
B-    70
dtype: int64

In [15]:
D = pd.DataFrame({'Mark': marks_dict, 'Grade':grades_dict})
D

    Mark  Grade
A     85    4.0
A-    80    3.5
B     65    2.0
B-    70    2.5

In [16]:
D.T

          A    A-     B    B-
Mark   85.0  80.0  65.0  70.0
Grade   4.0   3.5   2.0   2.5

In [18]:
D.values

array([[85. ,  4. ],
       [80. ,  3.5],
       [65. ,  2. ],
       [70. ,  2.5]])

In [23]:
D.values[2, 0]

65.0

In [24]:
D.columns

Index(['Mark', 'Grade'], dtype='object')

In [25]:
D.index

Index(['A', 'A-', 'B', 'B-'], dtype='object')

In [27]:
# add columns
D['ScaleMarks'] = 100 * (D['Mark'] / 90)
D

    Mark  Grade  ScaleMarks
A     85    4.0   94.444444
A-    80    3.5   88.888889
B     65    2.0   72.222222
B-    70    2.5   77.777778

In [28]:
# delete
del D['ScaleMarks']

In [29]:
D

    Mark  Grade
A     85    4.0
A-    80    3.5
B     65    2.0
B-    70    2.5

In [30]:
G = D[D['Mark'] > 70]
G

    Mark  Grade
A     85    4.0
A-    80    3.5

In [35]:
A = pd.DataFrame([{'a' : 1, 'b' : 2}, {'b' : 3,'c' : 4}])
A

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [37]:
A.fillna(0)

     a  b    c
0  1.0  2  0.0
1  0.0  3  4.0

In [38]:
# A.dropna?

In [40]:
# explicit index use loc
# implicit index use iloc

In [43]:
A = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
A

1    a
3    b
5    c
dtype: object

In [46]:
A[1]

'a'

In [47]:
# WHy ??
A[1:3]

3    b
5    c
dtype: object

In [48]:
A.loc[1:3]

1    a
3    b
dtype: object

In [49]:
A.iloc[1:3]

3    b
5    c
dtype: object

In [51]:
D

    Mark  Grade
A     85    4.0
A-    80    3.5
B     65    2.0
B-    70    2.5

In [52]:
D.iloc[2,:]

Mark     65.0
Grade     2.0
Name: B, dtype: float64

In [55]:
# D.loc[2,:]

In [56]:
D.iloc[::-1,:]

    Mark  Grade
B-    70    2.5
B     65    2.0
A-    80    3.5
A     85    4.0

In [57]:
# csv files

In [61]:
from sklearn.impute import SimpleImputer

In [88]:
df = pd.read_csv('./dataset/covid_19_data.csv')
df.head()

,SNo,ObservationDate,Province/State,Country/Region,Last Update,Confirmed,Deaths,Recovered
0,1,01/22/2020,Anhui,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
1,2,01/22/2020,Beijing,Mainland China,1/22/2020 17:00,14.0,0.0,0.0
2,3,01/22/2020,Chongqing,Mainland China,1/22/2020 17:00,6.0,0.0,0.0
3,4,01/22/2020,Fujian,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
4,5,01/22/2020,Gansu,Mainland China,1/22/2020 17:00,0.0,0.0,0.0

In [89]:
df.drop(['SNo', 'Last Update'], axis=1, inplace=True)

In [90]:
df.head()

  ObservationDate Province/State  Country/Region  Confirmed  Deaths  Recovered
0      01/22/2020          Anhui  Mainland China        1.0     0.0        0.0
1      01/22/2020        Beijing  Mainland China       14.0     0.0        0.0
2      01/22/2020      Chongqing  Mainland China        6.0     0.0        0.0
3      01/22/2020         Fujian  Mainland China        1.0     0.0        0.0
4      01/22/2020          Gansu  Mainland China        0.0     0.0        0.0

In [91]:
df.rename(columns={'ObservationDate':'Date', 'Province/State':'Province', 'Country/Region':'Country'}, inplace=True)

In [92]:
df.head()

         Date   Province         Country  Confirmed  Deaths  Recovered
0  01/22/2020      Anhui  Mainland China        1.0     0.0        0.0
1  01/22/2020    Beijing  Mainland China       14.0     0.0        0.0
2  01/22/2020  Chongqing  Mainland China        6.0     0.0        0.0
3  01/22/2020     Fujian  Mainland China        1.0     0.0        0.0
4  01/22/2020      Gansu  Mainland China        0.0     0.0        0.0

In [93]:
df['Date'] = pd.to_datetime(df['Date'])

In [94]:
df.head()

        Date   Province         Country  Confirmed  Deaths  Recovered
0 2020-01-22      Anhui  Mainland China        1.0     0.0        0.0
1 2020-01-22    Beijing  Mainland China       14.0     0.0        0.0
2 2020-01-22  Chongqing  Mainland China        6.0     0.0        0.0
3 2020-01-22     Fujian  Mainland China        1.0     0.0        0.0
4 2020-01-22      Gansu  Mainland China        0.0     0.0        0.0

In [95]:
df.describe()

          Confirmed         Deaths     Recovered
count  3.064290e+05  306429.000000  3.064290e+05
mean   8.567091e+04    2036.403268  5.042029e+04
std    2.775516e+05    6410.938048  2.015124e+05
min   -3.028440e+05    -178.000000 -8.544050e+05
25%    1.042000e+03      13.000000  1.100000e+01
50%    1.037500e+04     192.000000  1.751000e+03
75%    5.075200e+04    1322.000000  2.027000e+04
max    5.863138e+06  112385.000000  6.399531e+06

In [99]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 306429 entries, 0 to 306428
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date       306429 non-null  datetime64[ns]
 1   Province   306429 non-null  object
 2   Country    306429 non-null  object
 3   Confirmed  306429 non-null  float64
 4   Deaths     306429 non-null  float64
 5   Recovered  306429 non-null  float64
dtypes: datetime64[ns](1), float64(3), object(2)
memory usage: 14.0+ MB

In [102]:
df = df.fillna('NA')
df[70:80]

         Date    Province         Country  Confirmed  Deaths  Recovered
70 2020-01-23       Tibet  Mainland China        0.0     0.0        0.0
71 2020-01-23  Washington              US        1.0     0.0        0.0
72 2020-01-23    Xinjiang  Mainland China        2.0     0.0        0.0
73 2020-01-23      Yunnan  Mainland China        2.0     0.0        0.0
74 2020-01-23    Zhejiang  Mainland China       27.0     0.0        0.0
75 2020-01-23          NA           Japan        1.0     0.0        0.0
76 2020-01-23          NA        Thailand        4.0     0.0        2.0
77 2020-01-23          NA     South Korea        1.0     0.0        0.0
78 2020-01-23          NA       Singapore        1.0     0.0        0.0
79 2020-01-23          NA     Philippines        0.0     0.0        0.0

In [104]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 306429 entries, 0 to 306428
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date       306429 non-null  datetime64[ns]
 1   Province   306429 non-null  object
 2   Country    306429 non-null  object
 3   Confirmed  306429 non-null  float64
 4   Deaths     306429 non-null  float64
 5   Recovered  306429 non-null  float64
dtypes: datetime64[ns](1), float64(3), object(2)
memory usage: 14.0+ MB

In [110]:
imputer = SimpleImputer(strategy='constant')
df2 = pd.DataFrame(imputer.fit_transform(df), columns=df.columns)

In [111]:
df2

,Date,Province,Country,Confirmed,Deaths,Recovered
0,2020-01-22,Anhui,Mainland China,1.0,0.0,0.0
1,2020-01-22,Beijing,Mainland China,14.0,0.0,0.0
2,2020-01-22,Chongqing,Mainland China,6.0,0.0,0.0
3,2020-01-22,Fujian,Mainland China,1.0,0.0,0.0
4,2020-01-22,Gansu,Mainland China,0.0,0.0,0.0
...,...,...,...,...,...,...
306424,2021-05-29,Zaporizhia Oblast,Ukraine,102641.0,2335.0,95289.0
306425,2021-05-29,Zeeland,Netherlands,29147.0,245.0,0.0
306426,2021-05-29,Zhejiang,Mainland China,1364.0,1.0,1324.0
306427,2021-05-29,Zhytomyr Oblast,Ukraine,87550.0,1738.0,83790.0
306428,2021-05-29,Zuid-Holland,Netherlands,391559.0,4252.0,0.0

In [121]:
# df2 = df.groupby('Country')[['Country', 'Confirmed', 'Deaths', 'Recovered']].sum().reset_index()
df2 = df.groupby('Country')[['Country', 'Confirmed', 'Deaths', 'Recovered']].sum(numeric_only=True).reset_index()

In [118]:
df2

                            Country   Confirmed    Deaths   Recovered
0                        Azerbaijan         1.0       0.0         0.0
1                   ('St. Martin',)         2.0       0.0         0.0
2                       Afghanistan  17026442.0  669075.0  13464399.0
3                           Albania  19768869.0  375955.0  13945256.0
4                           Algeria  27684358.0  834464.0  18959299.0
..                              ...         ...       ...         ...
224              West Bank and Gaza  41819444.0  440378.0  37003116.0
225                           Yemen    962066.0  237613.0    506523.0
226                          Zambia  13493953.0  205990.0  12625626.0
227                        Zimbabwe   6484581.0  237234.0   5594887.0
228  occupied Palestinian territory        25.0       0.0         0.0

[229 rows x 4 columns]

In [122]:
df2 = df.groupby(['Country','Date'])[['Country','Date','Confirmed','Deaths','Recovered']].sum(numeric_only=True).reset_index()

In [124]:
df2.head()

           Country       Date  Confirmed  Deaths  Recovered
0       Azerbaijan 2020-02-28        1.0     0.0        0.0
1  ('St. Martin',) 2020-03-10        2.0     0.0        0.0
2      Afghanistan 2020-02-24        1.0     0.0        0.0
3      Afghanistan 2020-02-25        1.0     0.0        0.0
4      Afghanistan 2020-02-26        1.0     0.0        0.0

In [126]:
df3 = df2[df2['Confirmed']>100]
df3.head()

        Country       Date  Confirmed  Deaths  Recovered
35  Afghanistan 2020-03-28      107.0     4.0        2.0
36  Afghanistan 2020-03-29      118.0     4.0        2.0
37  Afghanistan 2020-03-30      146.0     4.0        2.0
38  Afghanistan 2020-03-31      175.0     4.0        5.0
39  Afghanistan 2020-04-01      197.0     4.0        5.0

In [36]:
B =pd.DataFrame({'a' : 1, 'b' : 2}, {'b' : 3,'c' : 4})
B

   a  b
b  1  2
c  1  2

In [ ]:
A